// Задача 2: Задайте строку, содержащую латинские буквы
// в обоих регистрах. Сформируйте строку, в которой все
// заглавные буквы заменены на строчные. 

System.Console.WriteLine("Введите строку");
string Input = Console.ReadLine();



Console.WriteLine(Input.ToLower());